{
  "backend/main.mo": "Minimal Motoko canister actor with no exposed methods or logic.",
  "feature_evidence.json": "Metadata file listing feature implementations, associated source files, components, tests, and confidence levels for recent profile photo features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing styles, components, hooks, and profile‑related logic.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, theming variables, and global background/foreground styling for light and dark modes.",
  "frontend/index.html": "HTML entry point with SEO metadata and Google Fonts setup, loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app composing navigation, profile sections, theme provider, and resume intake dialog with loading and empty‑state handling.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing contact info, social links, and attribution based on profile data.",
  "frontend/src/components/layout/PageShell.tsx": "Simple layout wrapper providing full‑height background structure for all pages.",
  "frontend/src/components/layout/Section.tsx": "Reusable section wrapper with standardized spacing and container layout using utility class merging.",
  "frontend/src/components/nav/TopNav.tsx": "Responsive top navigation bar with scroll‑spy highlighting, smooth scrolling, mobile menu, and edit button.",
  "frontend/src/components/resume/ResumeIntakeDialog.tsx": "Provides a dialog for users to paste or manually enter resume data, parse it, optionally upload a photo, and submit a ProfileData object.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About Me section displaying the profile summary if available.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details such as email, location, LinkedIn, and GitHub when provided in the profile.",
  "frontend/src/components/sections/EducationSection.tsx": "Shows a grid of education entries including degree, institution, dates, and optional details.",
  "frontend/src/components/sections/ExperienceSection.tsx": "Renders professional experience cards with positions, companies, dates, descriptions, and highlights.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays a hero banner with name, title, summary, call-to-action buttons, and a profile photo.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Lists user projects with descriptions, technologies used, and optional external links.",
  "frontend/src/components/sections/SkillsSection.tsx": "Shows a list of skills as badges if present in the profile.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login flow, and status flags.",
  "frontend/src/hooks/useResumeProfile.ts": "Manages profile data persistence in localStorage with load, update, and reset helpers.",
  "frontend/src/hooks/useScrollSpy.ts": "Tracks the currently active section based on scroll position and returns its ID.",
  "frontend/src/hooks/useSeoMetadata.ts": "Updates document title and meta tags based on profile data for SEO and social sharing.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light/dark modes and typography.",
  "frontend/src/lib/utils.ts": "Utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, rendering the root component.",
  "frontend/src/profile/parseResume.ts": "Parses raw resume text into structured profile data by extracting fields like name, contact info, skills, experience, and education.",
  "frontend/src/profile/storage.ts": "Handles saving, loading, clearing, and validating profile data from localStorage.",
  "frontend/src/profile/types.ts": "Defines TypeScript interfaces for profile data, experience, education, and projects, plus an empty profile template.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, animations, plugins, and container settings.",
  "project_state.json": "Describes the project's current state, version, implemented features, and requirements metadata."
}